Revit 2027 API
BuiltInFailures.SiteFailures.ToposolidSlopeExceedsThreshold Property
 Thickness of this Toposolid may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ToposolidSlopeExceedsThreshold { get; }
Public Shared ReadOnly Property ToposolidSlopeExceedsThreshold As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ToposolidSlopeExceedsThreshold {
	FailureDefinitionId^ get ();
}
static member ToposolidSlopeExceedsThreshold : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace